load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
  engines:
    socketio:
      transports: ["websocket"]
  socketio:
    transports: ["websocket"]  # <-- This is required

scenarios:
  - name: "Join room test"
    engine: socketio
    flow:
      - emit:
          channel: "joinRoom"
          data: { roomId: "test-room", username: "user_{{ $uuid }}" }
      - think: 60